# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка

length = 0
max_lenhth = 0
for fruit in fruits:
    length = len(fruit)
    if length > max_lenhth:
        max_lenhth = length

number = 0
for fruit in fruits:
    number += 1
    print(number, fruit.rjust(max_lenhth))
