## "Таблица умножение"

### Задание

Требуется вывести на экран двумерную таблицу умножения от 1 до n.

### Формат входных данных

Дано целое положительное число n. 1 < n < 9

### Формат выходных данных

Вывести таблицу умножения. Смотри пример.\
Если знаете как, выравняйте выводимые значения как в примере.

#### Пример
```
Входные данные
n = 5
Выходные данные
1  2  3  4  5  
2  4  6  8 10 
3  6  9 12 15 
4  8 12 16 20 
5 10 15 20 25
```

### Решение задачи

```python
# TODO: you code here...

print("Введите целое число от 1 до 9")
n = int(input())
if n < 1 or n > 9:
    print('ведите число больше единицы и меньше девяти!')
    n = int(input())
line = 1
column = 1
product_operation = 1

while line <= n:
    while column <= n:
        product_operation = column * line
        print(product_operation, end="   ")
        column += 1
    print()
    column = 1
    line += 1
